# задача 2

# Найти площадь и периметр прямоугольного треугольникаПримечание:
# В данном решении используйте модуль math.

import math
# a = float(input('введите 1 сторону треугольника: '))
# b = float(input('введите 2 сторону треугольника: '))
#
# print((a+b)*2)


#   задача 3
# Создать 4 переменных.
# С типом данных целых чисел, чисел с плавающей точкой, логическим и строковым.
# Преобразовать числа в строку.


# a = int(input('введите цклое число: '))
# b = float(input('введите дробное число: '))
# c = True
# d = input('введите текст: ')
# n = str(a)
# m = str(b)
# print(a,b,c,n,m)



# Задание №4
# Запросить у пользователя имя, фамилию, отчество, возраст и город проживания.
# Вывести на экран ФИО в одну строку. Возраст и город в отдельных.

# name = input('введите имя: ')
# surname = input('введите фамилию: ')
# patronymic = input('введите отчество: ')
# age = int(input('ваш возраст: '))
# sity =  input('ваш город: ')
# print(name, surname, patronymic)
# print(age, sity)

# Задание №5
#
# Ввести 3 числа и выполнить с ними все математические операции в различных комбинациях(+,-,/,**)

# a=float(input('введите 1 число; '))
# b=float(input('введите 2 число; '))
# c=float(input('введите 3 число; '))
# print(a+b/c, a*b/c, a**2-b+c)

#ДЗ
# Задача: Вычислить сумму цифр случайного трёхзначного числа

# import random
# a= random.randint(100, 999)
# n = a//10
# m = n%10
# b = a//100
# d = a%10
# print(m+d+b)
